app/views/articles/edit.html.erb

from the edit which looked up the article instance using the .find(), it then
saved the id we found using params,we then assigned Article.find to
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]