app/controllers/articles_controller.rb

  def edit
    # This instance is being sent to the edit view page's form_for.
    # The form_for will receive this instance knowing it is not a new instance
    # rather that it already exists, because it knows the instance already exists
    # it will send the form info to the update action! Cool right?
    #form_for knows to go to the update when submitted because it recieved an instance!

    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    # Query the database for the Article record that matches the :id passed to the route.
    # Store the query in an instance variable.
    # Update the values passed from the form
    # Save the changes in the database.
    # Redirect the user to the show page so they can see the updated record.

    # Step 1/2 - Query and save it to an instance varaible

    @article = Article.find(params[:id])

    # Step 3 - Update the values passed from the form by adding params in the update method.

    @article.update(title: params[:article][:title], description: params[:article][:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-11-06 17:27:27.818052"], ["id", 1]]